app/Controllers/DetailFoto.php

SELECT `photos`.`id`, `photos`.`photo_name`, `photos`.`album_id`, `photos`.`description`, `photos`.`location`, `photos`.`url_title`, `users`.`username`, `photos`.`created_at`
FROM `photos`
JOIN `album` ON `album`.`id` = `photos`.`album_id`
JOIN `users` ON `users`.`id` = `album`.`user_id`
WHERE `url_title` = 'sasa'
---
    public function index($url)
    {
        $db = \Config\Database::connect();
        $query = $db->table('photos')
            ->select('photos.id, photos.photo_name, photos.album_id, photos.description, photos.location, photos.url_title, users.username, photos.created_at')
            ->join('album', 'album.id = photos.album_id')
            ->join('users', 'users.id = album.user_id')
            ->where('url_title', $url)
            ->get()
            ->getRowArray();