app/Controllers/Home.php

    public function index()
    {
        $data = [
            'user' => '<span class="far fa-sign-in"></span>Login',
            'category' => (new CategoryModel())->findAll(),
            'photos' => (new PhotosModel())->findAll()
---
SELECT *
FROM `category`
SELECT *
FROM `photos`

    public function create_album()
    {
        $data = [
            'category' => (new CategoryModel())->findAll()
        ];
---
SELECT *
FROM `category`

    public function create_photo()
    {
        $data = [
            'album' => (new AlbumModel())->where('user_id', session()->get('id'))->findAll()
        ];
---
SELECT *
FROM `album`
WHERE `user_id` = '6'

    public function remove_album($album_id)
    {
        $albumModel = new AlbumModel();
        $photoModel = new PhotosModel();

        // Dapatkan semua foto yang terkait dengan album ini
        $photos = $photoModel->where('album_id', $album_id)->findAll();

        // Hapus setiap foto dari penyimpanan fisik dan database
        foreach ($photos as $photo) {
            $this->remove_photo($photo['id']);
        }

        // Hapus album dari database
        $albumModel->delete($album_id);
---
SELECT *
FROM `photos`
WHERE `album_id` = '7'
DELETE FROM `album`
WHERE `id` IN ('7')

    public function getAllAlbum()
    {
        $db = db_connect();
        $res1 = $db->table('album')->select('album.id as id,album.album_name, users.username, users.avatar, users.fullname, users.id as user_id')
            ->join('users', 'users.id = album.user_id')
            ->get()
            ->getResultArray();
        $res2 = $db->table('photos')->get()->getResultArray();
        $res3 = $db->table('like_photos')->get()->getResultArray();
---
SELECT `album`.`id` as `id`, `album`.`album_name`, `users`.`username`, `users`.`avatar`, `users`.`fullname`, `users`.`id` as `user_id`
FROM `album`
JOIN `users` ON `users`.`id` = `album`.`user_id`
SELECT *
FROM `vw_album`
SELECT *
FROM `like_photos`
SELECT *
FROM `photos`

    public function getAllAlbumMe()
    {
        $db = db_connect();
        $res1 = $db->table('album')->select('album.id as id,album.album_name, users.username, users.avatar, users.fullname, users.id as user_id')
            ->join('users', 'users.id = album.user_id')
            ->where('album.user_id', session()->get('id'))
            ->get()
            ->getResultArray();
        $res2 = $db->table('photos')->get()->getResultArray();
        $res3 = $db->table('like_photos')->get()->getResultArray();
---
SELECT `album`.`id` as `id`, `album`.`album_name`, `users`.`username`, `users`.`avatar`, `users`.`fullname`, `users`.`id` as `user_id`
FROM `album`
JOIN `users` ON `users`.`id` = `album`.`user_id`
WHERE `album`.`user_id` = '6'
SELECT *
FROM `like_photos`
SELECT *
FROM `photos`

    function getComment($pId)
    {
        $db = db_connect();

        $res = $db->table('comment_photos')
            ->select('comment_photos.*, users.username')
            ->join('users', 'users.id = comment_photos.user_id')
            ->where('photo_id', $pId)
            ->orderBy('comment_photos.created_at', 'DESC') // Mengurutkan berdasarkan created_at dari yang terbaru
            ->get()
            ->getResultArray();
---
SELECT `comment_photos`.*, `users`.`username`
FROM `comment_photos`
JOIN `users` ON `users`.`id` = `comment_photos`.`user_id`
WHERE `photo_id` = '10'
ORDER BY `comment_photos`.`created_at` DESC

    function getCountLike($pId)
    {
        $db = db_connect();

        $res = $db->table('like_photos')
            ->select('count(*) as count')
            ->where('photo_id', $pId)
            ->get()
            ->getRow();
---
SELECT count(*) as count
FROM `like_photos`
WHERE `photo_id` = '8'