app/Controllers/Home.php

    public function getAllAlbum()
    {
        $db = db_connect();
        $res1 = $db->table('album')->select('album.id as id,album.album_name, users.username, users.avatar, users.fullname, users.id as user_id')
            ->join('users', 'users.id = album.user_id')
            ->get()
            ->getResultArray();
        $res2 = $db->table('photos')->get()->getResultArray();
        $res3 = $db->table('like_photos')->get()->getResultArray();
---
SELECT `album`.`id` as `id`, `album`.`album_name`, `users`.`username`, `users`.`avatar`, `users`.`fullname`, `users`.`id` as `user_id`
FROM `album`
JOIN `users` ON `users`.`id` = `album`.`user_id`
SELECT *
FROM `photos`
SELECT *
FROM `like_photos`

    function getComment($pId)
    {
        $db = db_connect();

        $res = $db->table('comment_photos')
            ->select('comment_photos.*, users.username')
            ->join('users', 'users.id = comment_photos.user_id')
            ->where('photo_id', $pId)
            ->orderBy('comment_photos.created_at', 'DESC') // Mengurutkan berdasarkan created_at dari yang terbaru
            ->get()
            ->getResultArray();
---
SELECT `comment_photos`.*, `users`.`username`
FROM `comment_photos`
JOIN `users` ON `users`.`id` = `comment_photos`.`user_id`
WHERE `photo_id` = '3'
ORDER BY `comment_photos`.`created_at` DESC

    function getCountLike($pId)
    {
        $db = db_connect();

        $res = $db->table('like_photos')
            ->select('count(*) as count')
            ->where('photo_id', $pId)
            ->get()
            ->getRow();
---
SELECT count(*) as count
FROM `like_photos`
WHERE `photo_id` = '3'