app/Controllers/Login.php

    public function ceklogin()
    {
        $login = $this->request->getPost('login');
        $password = $this->request->getPost('password');
        $findUser = $this->users->where('email', $login)->orWhere('username', $login)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'master07'
OR `username` = 'master07'
 LIMIT 1