app/Controllers/MyPhotos.php

    public function index()
    {
        $data = [
            'user' => '<span class="far fa-sign-in"></span>Login',
            'category' => (new CategoryModel())->findAll(),
            'photos' => (new PhotosModel())->findAll()
---
SELECT *
FROM `category`
SELECT *
FROM `photos`