app/Controllers/Users.php

SELECT *
FROM `users`
---
	public function getAll()
	{
		$response = $data['data'] = array();

		$result = $this->usersModel->select()->findAll();